Add mermaid chart
